src/test/resources/api/testdata/input/Request XML/ReadBenefitAndDrugEligibility_Request1.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v8="http://upm4.apiengine.optum.com/optumrx/member/readbenefitanddrugeligibility/v8">
   <soapenv:Header>
               <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
               <wsse:UsernameToken xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="UsernameToken-1">
               <wsse:Username>pas_test</wsse:Username>
               <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">LGL5m4ae</wsse:Password>
               <wsse:Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">jBZhRVZ80Rk12LOVdFZ5og==</wsse:Nonce>
               <wsu:Created>2013-12-11T21:10:18.435Z</wsu:Created>
               </wsse:UsernameToken>
               </wsse:Security>
               </soapenv:Header>
   <soapenv:Body>
      <v8:invokeService>
         <!--Optional:-->
         <arg0>
               <requestHeader>
               <applicationName>PAS</applicationName>
               <applicationInstanceName>PAS</applicationInstanceName>
               <logLevel>DEBUG</logLevel>
               <externalId>PAS</externalId>
               </requestHeader>
               <Authentication>
<!-- <profilePassword>PAS</profilePassword>-->
<!-- <profileUserId>PAS</profileUserId>-->
               </Authentication>
               <CarCode></CarCode>
               <AccCode></AccCode>
               <GrpCode></GrpCode>
               <Plan></Plan>
               <gpi></gpi>
               <ndc></ndc>
               <rea>OD</rea>
               <clm></clm>
               <seq></seq>
               <flg>BEN</flg>
               <ProdFlag>GPI8</ProdFlag>
               <rxClaimInstanceIdentifier>SXCD1_D1QA</rxClaimInstanceIdentifier>
               </arg0>
      </v8:invokeService>
   </soapenv:Body>
</soapenv:Envelope>
